/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50724
 Source Host           : localhost
 Source Database       : ita

 Target Server Type    : MySQL
 Target Server Version : 50724
 File Encoding         : utf-8

 Date: 04/10/2020 11:57:36 AM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `player_info`
-- ----------------------------
DROP TABLE IF EXISTS `player_info`;
CREATE TABLE `player_info` (
  `player_id` int(4) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `player_name` varchar(50) CHARACTER SET utf8 DEFAULT NULL,
  `live_search_count` int(5) NOT NULL DEFAULT '0',
  `pre_search_count` int(5) NOT NULL DEFAULT '0',
  PRIMARY KEY (`player_id`)
) ENGINE=InnoDB AUTO_INCREMENT=93 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `player_info`
-- ----------------------------
BEGIN;
INSERT INTO `player_info` VALUES ('1', '小星', '1', '0'), ('2', 'Marc', '1', '0'), ('3', 'David', '0', '0'), ('4', '轩轩', '0', '0'), ('5', 'Eric', '8', '0'), ('6', '小弦', '0', '0'), ('7', '小沙', '0', '0'), ('8', '杰', '0', '0'), ('9', '阳阳', '0', '0'), ('10', '剑胆琴心', '0', '0'), ('11', '十六', '0', '0'), ('12', '月巴', '0', '0'), ('13', '月月', '0', '0'), ('14', 'Alex', '0', '0'), ('15', 'VP', '0', '0'), ('16', '宇凡', '0', '0'), ('17', '灏灏', '0', '0'), ('18', 'KT', '0', '0'), ('19', '奥巴马', '0', '0'), ('20', '肖恩', '0', '0'), ('21', '小花', '0', '0'), ('22', '心语', '0', '0'), ('23', '豆豆', '0', '0'), ('24', '安狄', '0', '0'), ('25', '肖', '0', '0'), ('26', '平安', '0', '0'), ('27', '查无此虎', '0', '0'), ('28', '无', '0', '0'), ('29', 'Austin.SL', '0', '0'), ('30', '沙漠', '0', '0'), ('31', 'Steven', '0', '0'), ('32', 'Joker', '0', '0'), ('33', '董老师', '0', '0'), ('34', '小先森', '0', '0'), ('35', '尼克', '0', '0'), ('36', 'Roger', '0', '0'), ('37', '叶星辰', '0', '0'), ('38', '熊普', '0', '0'), ('39', 'TT', '0', '0'), ('40', '小忠', '0', '0'), ('41', '梓晨', '0', '0'), ('42', '丁丁', '0', '0'), ('43', 'Eddy', '0', '0'), ('44', 'Paul', '0', '0'), ('45', '灰羽', '0', '0'), ('46', '阿什理', '2', '0'), ('47', '汤姆', '0', '0'), ('48', 'TonyTang', '0', '0'), ('49', '陶老师', '0', '0'), ('50', '小新', '0', '0'), ('51', 'Jerry', '0', '0'), ('52', '菊丸', '0', '0'), ('53', '小强', '0', '0'), ('54', 'Jeremy', '0', '0'), ('55', '阿吃吃', '0', '0'), ('56', '宇', '0', '0'), ('57', 'Escape', '0', '0'), ('58', 'Kroos', '0', '0'), ('59', '乐乐', '0', '0'), ('60', '不羁的风', '0', '0'), ('61', '999', '0', '0'), ('62', '小狼', '0', '0'), ('63', '美黑', '0', '0'), ('64', 'Richard', '0', '0'), ('65', 'Iwan', '0', '0'), ('66', 'Luves', '0', '0'), ('67', 'Sivan', '0', '0'), ('68', '司文', '0', '0'), ('69', '特力屋', '0', '0'), ('70', 'Cicero', '0', '0'), ('71', 'Arthur', '0', '0'), ('72', '小象', '0', '0'), ('73', '芥末', '0', '0'), ('74', 'Simon斯', '0', '0'), ('75', '黑老师', '0', '0'), ('76', '德二子', '0', '0'), ('77', '建建', '0', '0'), ('78', '阿补', '0', '0'), ('79', '嘉琪', '0', '0'), ('80', '老谭', '0', '0'), ('81', '呆瑞克', '0', '0'), ('82', 'Beta', '0', '0'), ('83', '吐司', '0', '0'), ('84', '小船儿', '0', '0'), ('85', '莎娃', '0', '0'), ('86', '小朱', '0', '0'), ('87', 'Philip', '0', '0'), ('88', '小林', '0', '0'), ('89', '莹莹', '0', '0'), ('90', '飞飞', '0', '0'), ('91', '普陀穆雷', '0', '0'), ('92', '东方', '0', '0');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
