/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50724
 Source Host           : localhost
 Source Database       : ita

 Target Server Type    : MySQL
 Target Server Version : 50724
 File Encoding         : utf-8

 Date: 04/10/2020 11:57:49 AM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `score_board`
-- ----------------------------
DROP TABLE IF EXISTS `score_board`;
CREATE TABLE `score_board` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `event_id` int(5) NOT NULL,
  `event_name` varchar(100) CHARACTER SET utf8 NOT NULL,
  `round` varchar(10) CHARACTER SET utf8 NOT NULL,
  `week` int(2) NOT NULL,
  `season` int(1) NOT NULL,
  `player_1_id` int(4) NOT NULL,
  `player_1_name` varchar(100) CHARACTER SET utf8 NOT NULL,
  `player_1_score` int(2) NOT NULL,
  `player_2_id` int(4) NOT NULL,
  `player_2_name` varchar(100) CHARACTER SET utf8 NOT NULL,
  `player_2_score` int(2) NOT NULL,
  `wo` int(1) NOT NULL DEFAULT '0' COMMENT '是否赛前退赛：0-未退赛 1-退赛',
  `ret` int(1) NOT NULL DEFAULT '0' COMMENT '是否赛中退赛：0-无退赛 1-player1退赛 2-player2退赛',
  `event_level` varchar(10) CHARACTER SET utf8 NOT NULL,
  `level_code` varchar(10) CHARACTER SET utf8 NOT NULL,
  `handle` int(1) unsigned zerofill NOT NULL,
  `player_1_rank` int(4) unsigned zerofill NOT NULL,
  `player_2_rank` int(4) unsigned zerofill NOT NULL,
  `match_mode` int(1) NOT NULL COMMENT '0-单打 1-双打',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `score_board`
-- ----------------------------
BEGIN;
INSERT INTO `score_board` VALUES ('1', '2001', '山河无恙杯赛', 'QR1', '2', '2', '32', 'Joker', '6', '89', '莹莹', '4', '0', '0', 'T2', 'BS16', '1', '31', '999', '0'), ('2', '2001', '山河无恙杯赛', 'QR1', '2', '2', '88', '小林', '6', '62', '小狼', '2', '0', '0', 'T2', 'BS16', '1', '87', '61', '0'), ('3', '2001', '山河无恙杯赛', 'QR1', '2', '2', '90', '飞飞', '7', '38', '熊普', '6', '0', '0', 'T2', 'BS16', '1', '999', '37', '0'), ('4', '2001', '山河无恙杯赛', 'QR1', '2', '2', '76', '德二子', '6', '68', '司文', '4', '0', '0', 'T2', 'BS16', '1', '72', '65', '0'), ('5', '2001', '山河无恙杯赛', 'QR1', '2', '2', '1', '小星', '6', '40', '小忠', '0', '0', '0', 'T2', 'BS16', '1', '64', '38', '0'), ('6', '2001', '山河无恙杯赛', 'QR1', '2', '2', '46', '阿什理', '6', '48', 'TonyTang', '4', '0', '0', 'T2', 'BS16', '1', '44', '47', '0'), ('7', '2001', '山河无恙杯赛', 'QR1', '2', '2', '91', '普陀穆雷', '6', '79', '嘉琪', '4', '0', '0', 'T2', 'BS16', '1', '999', '79', '0'), ('8', '2001', '山河无恙杯赛', 'QR1', '2', '2', '34', '小先森', '6', '53', '小强', '2', '0', '0', 'T2', 'BS16', '1', '33', '52', '0'), ('9', '2001', '山河无恙杯赛', 'QFi', '2', '2', '88', '小林', '6', '32', 'Joker', '2', '0', '0', 'T2', 'BS16', '1', '87', '31', '0'), ('10', '2001', '山河无恙杯赛', 'QFi', '2', '2', '90', '飞飞', '6', '76', '德二子', '4', '0', '0', 'T2', 'BS16', '1', '999', '72', '0'), ('11', '2001', '山河无恙杯赛', 'QFi', '2', '2', '46', '阿什理', '6', '1', '小星', '1', '0', '0', 'T2', 'BS16', '1', '44', '64', '0'), ('12', '2001', '山河无恙杯赛', 'QFi', '2', '2', '91', '普陀穆雷', '7', '34', '小先森', '6', '0', '0', 'T2', 'BS16', '1', '999', '33', '0'), ('13', '2001', '山河无恙杯赛', 'R16', '2', '2', '2', 'Marc', '6', '88', '小林', '1', '0', '0', 'T2', 'BS16', '1', '1', '87', '0'), ('14', '2001', '山河无恙杯赛', 'R16', '2', '2', '27', '查无此虎', '6', '16', '宇凡', '3', '0', '0', 'T2', 'BS16', '1', '26', '15', '0'), ('15', '2001', '山河无恙杯赛', 'R16', '2', '2', '6', '小弦', '6', '17', '灏灏', '2', '0', '0', 'T2', 'BS16', '1', '5', '16', '0'), ('16', '2001', '山河无恙杯赛', 'R16', '2', '2', '20', '肖恩', '7', '13', '月月', '5', '0', '0', 'T2', 'BS16', '1', '19', '12', '0'), ('17', '2001', '山河无恙杯赛', 'R16', '2', '2', '5', 'Eric', '6', '8', '杰', '2', '0', '0', 'T2', 'BS16', '1', '4', '7', '0'), ('18', '2001', '山河无恙杯赛', 'R16', '2', '2', '10', '剑胆琴心', '7', '11', '十六', '6', '0', '0', 'T2', 'BS16', '1', '9', '10', '0'), ('19', '2001', '山河无恙杯赛', 'R16', '2', '2', '46', '阿什理', '6', '90', '飞飞', '1', '0', '0', 'T2', 'BS16', '1', '44', '999', '0'), ('20', '2001', '山河无恙杯赛', 'R16', '2', '2', '4', '轩轩', '6', '91', '普陀穆雷', '1', '0', '0', 'T2', 'BS16', '1', '3', '999', '0'), ('21', '2001', '山河无恙杯赛', 'QF', '2', '2', '2', 'Marc', '6', '27', '查无此虎', '1', '0', '0', 'T2', 'BS16', '1', '1', '26', '0'), ('22', '2001', '山河无恙杯赛', 'QF', '2', '2', '6', '小弦', '6', '20', '肖恩', '0', '0', '0', 'T2', 'BS16', '1', '5', '19', '0'), ('23', '2001', '山河无恙杯赛', 'QF', '2', '2', '5', 'Eric', '6', '10', '剑胆琴心', '0', '0', '0', 'T2', 'BS16', '1', '4', '9', '0'), ('24', '2001', '山河无恙杯赛', 'QF', '2', '2', '46', '阿什理', '7', '4', '轩轩', '5', '0', '0', 'T2', 'BS16', '1', '44', '3', '0'), ('25', '2001', '山河无恙杯赛', 'SF', '2', '2', '2', 'Marc', '6', '6', '小弦', '3', '0', '0', 'T2', 'BS16', '1', '1', '5', '0'), ('26', '2001', '山河无恙杯赛', 'SF', '2', '2', '5', 'Eric', '3', '46', '阿什理', '1', '0', '2', 'T2', 'BS16', '1', '4', '44', '0'), ('27', '2001', '山河无恙杯赛', 'F', '2', '2', '5', 'Eric', '6', '2', 'Marc', '3', '0', '0', 'T2', 'BS16', '1', '4', '1', '0');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
